## Data Analytics Questions

You were given a 'practice_dataset.csv' dataset, that contains data about average salary of some school graduates.
Please read in this file here, and explore it.

In [ ]:
import pandas as pd
import json
import re
import requests
from bs4 import BeautifulSoup

In [ ]:
data = pd.read_csv('/content/practice_dataset.csv')

## Task 1.
In the dataset there is a 'School Type' column that has numircal values: they are IDs for keys that are given in 'school_type.json' file. Please, map over these IDs to replace them with their keys. Here is an expected outcome:

In [ ]:
with open('school_type.json', 'r') as json_file:
    values = json.load(json_file)

json_df = pd.DataFrame(values)

id_to_value_dict = dict(zip(json_df['ID'], json_df['VALUE']))

data['School Type'] = data['School Type'].map(id_to_value_dict)

In [ ]:
print(data)

                                      School Name  School Type  \
0     Massachusetts Institute of Technology (MIT)  Engineering
1        California Institute of Technology (CIT)  Engineering
2                             Harvey Mudd College  Engineering
3    Polytechnic University of New York, Brooklyn  Engineering
4                                    Cooper Union  Engineering
..                                            ...          ...
264                  Austin Peay State University        State
265                    Pittsburg State University        State
266                      Southern Utah University        State
267           Montana State University - Billings        State
268                  Black Hills State University        State

    Starting Median Salary Mid-Career Median Salary  \
0              $72,200.00              $126,000.00
1              $75,500.00              $123,000.00
2              $71,800.00              $122,000.00
3              $62,400.00              $114,000.00
4              $62,200.00              $114,000.00
..                     ...                      ...
264            $37,700.00               $59,200.00
265            $40,400.00               $58,200.00
266            $41,900.00               $56,500.00
267            $37,900.00               $50,600.00
268            $35,300.00               $43,900.00

    Mid-Career 10th Percentile Salary Mid-Career 25th Percentile Salary  \
0                         $76,800.00                        $99,200.00
1                                 NaN                      $104,000.00
2                                 NaN                       $96,000.00
3                         $66,800.00                        $94,300.00
4                                 NaN                       $80,200.00
..                                ...                               ...
264                       $32,200.00                        $40,500.00
265                       $25,600.00                        $46,000.00
266                       $30,700.00                        $39,700.00
267                       $22,600.00                        $31,800.00
268                       $27,000.00                        $32,200.00

    Mid-Career 75th Percentile Salary Mid-Career 90th Percentile Salary
0                        $168,000.00                       $220,000.00
1                        $161,000.00                                NaN
2                        $180,000.00                                NaN
3                        $143,000.00                       $190,000.00
4                        $142,000.00                                NaN
..                                ...                               ...
264                       $73,900.00                        $96,200.00
265                       $84,600.00                       $117,000.00
266                       $78,400.00                       $116,000.00
267                       $78,500.00                        $98,900.00
268                       $60,900.00                        $87,600.00

[269 rows x 8 columns]

![image-2.png](attachment:image-2.png)

## Task 2
We defined a function that takes any 'School Type' value, and estimates rounded average 'Mid-Career Median Salary'for it. However, our funciton is not working. Please find an error and try to fix it.

In [ ]:
def function_1(school_type):
    result=round(df[df['School Type']==school_type]['Mid-Career Median Salary'].mean(),2)
    return result

In [ ]:
function_1('Engineering')

If you fix an error, apply this function to values 'Engineering', 'Party', 'Liberal Arts' and print output of the function, the end result must looks like this:

![image.png](attachment:image.png)

In [ ]:
def extract_num_value(s):
    try:
        return float(s)
    except ValueError:
        numeric_part = ''.join(filter(str.isdigit, s))
        try:
            return float(numeric_part)
        except ValueError:
            return None

def function_1(school_type, data):
    data['Mid-Career Median Salary'] = data['Mid-Career Median Salary'].apply(extract_num_value)

    result = data[data['School Type'] == school_type]['Mid-Career Median Salary'].dropna().mean()

    return round(result / 100, 2)

In [ ]:
print(function_1('Engineering',data))
print(function_1('Party',data))
print(function_1('Liberal Arts',data))

103842.11
84685.0
89378.72

## Task 3
According to the National Occupational Employment and Wages Estimates, the average salary in the United States is 56,310 USD annaully. Iterate over 'Starting Median Salary' column and assign value 'more than national average' if it is more than 56,310 USD, else 'less than national average'. The result is supposed to be as such:

![image-2.png](attachment:image-2.png)

In [ ]:
salary = data['Starting Median Salary']
numbers = []
for i in range(len(salary)):
  numbers.append(salary[i].translate({ord(j): None for j in '$,.'}))

In [ ]:
int_salary = []
for i in numbers:
  int_salary.append(int(int(i)/100))

In [ ]:
monitoring_salary = []

for i in int_salary:
  if i > 56310:
    monitoring_salary.append('more than national average')
  else:
    monitoring_salary.append('less than national average')

result = pd.DataFrame(monitoring_salary)

In [ ]:
data['Starting Median Salary'] = result

In [ ]:
print(data)

                                      School Name  School Type  \
0     Massachusetts Institute of Technology (MIT)  Engineering
1        California Institute of Technology (CIT)  Engineering
2                             Harvey Mudd College  Engineering
3    Polytechnic University of New York, Brooklyn  Engineering
4                                    Cooper Union  Engineering
..                                            ...          ...
264                  Austin Peay State University        State
265                    Pittsburg State University        State
266                      Southern Utah University        State
267           Montana State University - Billings        State
268                  Black Hills State University        State

         Starting Median Salary  Mid-Career Median Salary  \
0    more than national average                12600000.0
1    more than national average                12300000.0
2    more than national average                12200000.0
3    more than national average                11400000.0
4    more than national average                11400000.0
..                          ...                       ...
264  less than national average                 5920000.0
265  less than national average                 5820000.0
266  less than national average                 5650000.0
267  less than national average                 5060000.0
268  less than national average                 4390000.0

    Mid-Career 10th Percentile Salary Mid-Career 25th Percentile Salary  \
0                         $76,800.00                        $99,200.00
1                                 NaN                      $104,000.00
2                                 NaN                       $96,000.00
3                         $66,800.00                        $94,300.00
4                                 NaN                       $80,200.00
..                                ...                               ...
264                       $32,200.00                        $40,500.00
265                       $25,600.00                        $46,000.00
266                       $30,700.00                        $39,700.00
267                       $22,600.00                        $31,800.00
268                       $27,000.00                        $32,200.00

    Mid-Career 75th Percentile Salary Mid-Career 90th Percentile Salary
0                        $168,000.00                       $220,000.00
1                        $161,000.00                                NaN
2                        $180,000.00                                NaN
3                        $143,000.00                       $190,000.00
4                        $142,000.00                                NaN
..                                ...                               ...
264                       $73,900.00                        $96,200.00
265                       $84,600.00                       $117,000.00
266                       $78,400.00                       $116,000.00
267                       $78,500.00                        $98,900.00
268                       $60,900.00                        $87,600.00

[269 rows x 8 columns]

Now, display all state schools that have less than national average salary.

In [ ]:
for i in range(len(int_salary)):
  if int_salary[i] < 56310:
    print(data['School Name'][i])

Illinois Institute of Technology (IIT)
Wentworth Institute of Technology
Virginia Polytechnic Institute and State University (Virginia Tech)
South Dakota School of Mines & Technology
New Mexico Institute of Mining and Technology (New Mexico Tech)
Rochester Institute of Technology (RIT)
Embry-Riddle Aeronautical University (ERAU)
Tennessee Technological University
University of Illinois at Urbana-Champaign (UIUC)
University of Maryland, College Park
University of California, Santa Barbara (UCSB)
University of Texas (UT) - Austin
State University of New York (SUNY) at Albany
University of Florida (UF)
Louisiana State University (LSU)
University of Georgia (UGA)
Pennsylvania State University (PSU)
Arizona State University (ASU)
Indiana University (IU), Bloomington
University of Iowa (UI)
Randolph-Macon College
University of Alabama, Tuscaloosa
University of Mississippi
University of New Hampshire (UNH)
West Virginia University (WVU)
University of Tennessee
Ohio University
Florida State University (FSU)
Bucknell University
Colgate University
Amherst College
Lafayette College
Bowdoin College
College of the Holy Cross
Occidental College
Washington and Lee University
Swarthmore College
Davidson College
Carleton College
Williams College
Pomona College
Wesleyan University (Middletown, Connecticut)
Bates College
Union College
University of Richmond
Vassar College
Middlebury College
Mount Holyoke College
Franklin and Marshall College
DePauw University
St. Olaf College
Colby College
Gettysburg College
Siena College
Smith College
Hamilton College
Randolph-Macon College
Wellesley College
Denison University
Oberlin College
University of Puget Sound
Colorado College (CC)
Reed College
Gustavus Adolphus College
Whitman College
Ursinus College
Juniata College
Wittenberg University
Grinnell College
Skidmore College
Moravian College
Lewis & Clark College
Fort Lewis College
Thomas Aquinas College
Evergreen State College
Brown University
University of Virginia (UVA)
University of California at Los Angeles (UCLA)
University of California, San Diego (UCSD)
University of California, Davis
University of Colorado - Boulder (UCB)
University of California, Irvine (UCI)
University of Illinois at Urbana-Champaign (UIUC)
Texas A&M University
Binghamton University
San Jose State University (SJSU)
University of Maryland, College Park
University of California, Santa Barbara (UCSB)
University of Texas (UT) - Austin
University of Michigan
Stony Brook University
State University of New York (SUNY) at Albany
Rutgers University
Purdue University
University of Connecticut (UConn)
University of Massachusetts (UMass) - Amherst
California State University (CSU), Chico
University of Florida (UF)
University of Wisconsin (UW) - Madison
Louisiana State University (LSU)
California State University, Fullerton (CSUF)
George Mason University
University of Massachusetts (UMass) - Lowell
San Francisco State University (SFSU)
University of Arizona
Clemson University
University of Georgia (UGA)
Pennsylvania State University (PSU)
University of Washington (UW)
Michigan State University (MSU)
University of Rhode Island (URI)
San Diego State University (SDSU)
Auburn University
Washington State University (WSU)
California State University, Long Beach (CSULB)
Iowa State University
University of Delaware
University of Colorado - Denver
California State University, East Bay (CSUEB)
State University of New York (SUNY) at Farmingdale
University of Minnesota
Arizona State University (ASU)
University of California, Santa Cruz (UCSC)
Indiana University (IU), Bloomington
University of Iowa (UI)
Ohio State University (OSU)
North Carolina State University (NCSU)
Oregon State University (OSU)
University of Utah
University of Nevada, Reno (UNR)
University of Oklahoma
University of Arkansas
University of Vermont (UVM)
University of Alabama at Huntsville (UAH)
California State University, Sacramento (CSUS)
University of Idaho
University of Illinois at Chicago
State University of New York (SUNY) at Buffalo
University of Kansas
University of New Mexico (UNM)
University of North Carolina at Chapel Hill (UNCH)
University of Alabama, Tuscaloosa
University of California, Riverside (UCR)
State University of New York (SUNY) at Geneseo
University of Missouri - Columbia
University of Nebraska
University of Texas at Arlington (UTA)
Northern Illinois University (NIU)
Oklahoma State University
University of North Dakota
California State University, Northridge (CSUN)
University of Houston (UH)
University of Mississippi
New Mexico State University
Lamar University
Mississippi State University (MSU)
Colorado State University (CSU)
Kansas State University (KSU)
University of Wyoming (UW)
Utah State University
University of Wisconsin (UW) - Platteville
University of Oregon
University of Kentucky (UK)
University of New Hampshire (UNH)
University of Massachusetts (UMass) - Boston
West Virginia University (WVU)
University of Maryland Baltimore County (UMBC)
North Dakota State University (NDSU)
State University of New York (SUNY) at Oswego
University of Massachusetts (UMass) - Dartmouth
Montana State University - Bozeman
State University of New York (SUNY) at Oneonta
University of Louisiana (UL) at Lafayette
State University of New York (SUNY) at Plattsburgh
Wayne State University
University of Hawaii
University of Toledo
Florida International University (FIU)
University of Wisconsin (UW) - Whitewater
Western Washington University
Minnesota State University - Mankato
University of Tennessee
University of Wisconsin (UW) - Milwaukee
University of Arkansas - Monticello (UAM)
Penn State - Harrisburg
University of North Carolina at Charlotte (UNCC)
Georgia State University
Western Michigan University (WMU)
South Dakota State University (SDSU)
Idaho State University
Ohio University
Illinois State University
Cleveland State University
Florida State University (FSU)
University of Alaska, Anchorage
Fitchburg State College
University of Nebraska at Omaha
Southern Illinois University Carbondale
University of Texas at El Paso (UTEP)
California State University, Dominguez Hills (CSUDH)
University Of Maine
Eastern Michigan University
Bowling Green State University
University of Montana
University of Central Florida (UCF)
University of South Carolina
University of Nevada, Las Vegas (UNLV)
St. Cloud State University
University of Wisconsin (UW) - Parkside
California State University (CSU), Stanislaus
Humboldt State University
Florida Atlantic University (FAU)
University of South Florida (USF)
Portland State University (PSU)
Eastern Washington University
University of Texas at San Antonio (UTSA)
University of Akron
State University of New York (SUNY) at Potsdam
University of Alabama at Birmingham (UAB)
University of Memphis (U of M)
Boise State University (BSU)
Missouri State University (MSU)
University of Wisconsin (UW) - La Crosse
Appalachian State University
Virginia Commonwealth University (VCU)
University of Wisconsin (UW) - Stout
East Carolina University (ECU)
Utah Valley State College
University of Missouri - St. Louis (UMSL)
Western Carolina University
University of Wisconsin (UW) - Oshkosh
State University of New York (SUNY) at Fredonia
University of Missouri - Kansas City (UMKC)
University of Wisconsin (UW) - Eau Claire
Ball State University (BSU)
University of North Carolina at Wilmington (UNCW)
University of Wisconsin (UW) - Stevens Point
University of Southern Maine
Arkansas State University (ASU)
Kent State University
Tarleton State University (TSU)
University of Wisconsin (UW) - Green Bay
Morehead State University
Austin Peay State University
Pittsburg State University
Southern Utah University
Montana State University - Billings
Black Hills State University

## Task4
You might have realised that some columns have missing values. Display all rows that has at least one missing value in any column. Then, consider how would you handle these missing values? Please, describe below your thoughts

In [ ]:

# Handling missing values depends on the importance of other values of particular
# column where we are missing a value and the result we want to get. For example,
# if second or third column has the most missing values, we can remove this column
# considering how this affects the result we want. Moreover, we can use different
# imputation like swapping missing values with mean of the whole column. Another
# way can be using the predictive models like regression to predict missing values.

In [ ]:
nan_check = data.isnull()

rows_with_nan = data[nan_check.any(axis=1)]

print(rows_with_nan)

                                          School Name   School Type  \
1            California Institute of Technology (CIT)   Engineering
2                                 Harvey Mudd College   Engineering
4                                        Cooper Union   Engineering
15  New Mexico Institute of Mining and Technology ...   Engineering
31                             Randolph-Macon College         Party
41                                    Amherst College  Liberal Arts
43                                    Bowdoin College  Liberal Arts
44                          College of the Holy Cross  Liberal Arts
45                                 Occidental College  Liberal Arts
46                      Washington and Lee University  Liberal Arts
47                                 Swarthmore College  Liberal Arts
48                                   Davidson College  Liberal Arts
49                                   Carleton College  Liberal Arts
50                                   Williams College  Liberal Arts
51                                     Pomona College  Liberal Arts
53                                      Bates College  Liberal Arts
56                                     Vassar College  Liberal Arts
57                                 Middlebury College  Liberal Arts
58                              Mount Holyoke College  Liberal Arts
59                      Franklin and Marshall College  Liberal Arts
62                                      Colby College  Liberal Arts
63                                 Gettysburg College  Liberal Arts
66                                   Hamilton College  Liberal Arts
67                             Randolph-Macon College  Liberal Arts
68                                  Wellesley College  Liberal Arts
69                                 Denison University  Liberal Arts
70                                    Oberlin College  Liberal Arts
72                              Colorado College (CC)  Liberal Arts
73                                       Reed College  Liberal Arts
74                          Gustavus Adolphus College  Liberal Arts
75                                    Whitman College  Liberal Arts
77                                    Juniata College  Liberal Arts
78                              Wittenberg University  Liberal Arts
79                                   Grinnell College  Liberal Arts
80                                   Skidmore College  Liberal Arts
81                                   Moravian College  Liberal Arts
83                                 Fort Lewis College  Liberal Arts
84                             Thomas Aquinas College  Liberal Arts

        Starting Median Salary  Mid-Career Median Salary  \
1   more than national average                12300000.0
2   more than national average                12200000.0
4   more than national average                11400000.0
15  less than national average                 9340000.0
31  less than national average                 8360000.0
41  less than national average                10700000.0
43  less than national average                10700000.0
44  less than national average                10600000.0
45  less than national average                10500000.0
46  less than national average                10400000.0
47  less than national average                10400000.0
48  less than national average                10400000.0
49  less than national average                10300000.0
50  less than national average                10200000.0
51  less than national average                10100000.0
53  less than national average                 9650000.0
56  less than national average                 9460000.0
57  less than national average                 9420000.0
58  less than national average                 9410000.0
59  less than national average                 9280000.0
62  less than national average                 8580000.0
63  less than national average                 8580000.0
66  less than national average                 8370000.0
67  less than national average                 8360000.0
68  less than national average                 8350000.0
69  less than national average                 8350000.0
70  less than national average                 8160000.0
72  less than national average                 8140000.0
73  less than national average                 8110000.0
74  less than national average                 8060000.0
75  less than national average                 8010000.0
77  less than national average                 7890000.0
78  less than national average                 7820000.0
79  less than national average                 7660000.0
80  less than national average                 7460000.0
81  less than national average                 7440000.0
83  less than national average                 6980000.0
84  less than national average                 6750000.0

   Mid-Career 10th Percentile Salary Mid-Career 25th Percentile Salary  \
1                                NaN                      $104,000.00
2                                NaN                       $96,000.00
4                                NaN                       $80,200.00
15                               NaN                       $67,400.00
31                               NaN                       $54,100.00
41                               NaN                       $84,900.00
43                               NaN                       $74,600.00
44                               NaN                       $65,600.00
45                               NaN                       $54,800.00
46                               NaN                       $82,800.00
47                               NaN                       $67,200.00
48                               NaN                       $70,500.00
49                               NaN                       $69,400.00
50                               NaN                       $76,400.00
51                               NaN                       $63,300.00
53                               NaN                       $60,700.00
56                               NaN                       $60,600.00
57                               NaN                       $69,100.00
58                               NaN                       $57,100.00
59                               NaN                       $55,800.00
62                               NaN                       $63,500.00
63                               NaN                       $66,300.00
66                               NaN                       $51,900.00
67                               NaN                       $54,100.00
68                               NaN                       $58,600.00
69                               NaN                       $62,100.00
70                               NaN                       $46,400.00
72                               NaN                       $43,000.00
73                               NaN                       $67,400.00
74                               NaN                       $49,300.00
75                               NaN                       $64,800.00
77                               NaN                       $67,200.00
78                               NaN                       $54,100.00
79                               NaN                       $65,100.00
80                               NaN                       $42,800.00
81                               NaN                       $56,700.00
83                               NaN                       $55,000.00
84                               NaN                       $44,600.00

   Mid-Career 75th Percentile Salary Mid-Career 90th Percentile Salary
1                       $161,000.00                                NaN
2                       $180,000.00                                NaN
4                       $142,000.00                                NaN
15                      $123,000.00                                NaN
31                      $123,000.00                                NaN
41                      $162,000.00                                NaN
43                      $146,000.00                                NaN
44                      $143,000.00                                NaN
45                      $157,000.00                                NaN
46                      $146,000.00                                NaN
47                      $167,000.00                                NaN
48                      $146,000.00                                NaN
49                      $141,000.00                                NaN
50                      $143,000.00                                NaN
51                      $161,000.00                                NaN
53                      $162,000.00                                NaN
56                      $123,000.00                                NaN
57                      $129,000.00                                NaN
58                      $131,000.00                                NaN
59                      $185,000.00                                NaN
62                      $129,000.00                                NaN
63                      $132,000.00                                NaN
66                      $123,000.00                                NaN
67                      $123,000.00                                NaN
68                      $125,000.00                                NaN
69                      $122,000.00                                NaN
70                      $128,000.00                                NaN
72                      $148,000.00                                NaN
73                      $101,000.00                                NaN
74                      $101,000.00                                NaN
75                      $111,000.00                                NaN
77                      $110,000.00                                NaN
78                      $131,000.00                                NaN
79                      $116,000.00                                NaN
80                      $147,000.00                                NaN
81                       $94,900.00                                NaN
83                       $94,000.00                                NaN
84                       $93,100.00                                NaN

## Task 5
Please visit this web page: https://www.upgradabroad.com/articles/forbes-unveils-americas-top-colleges-2022-list-news/
It contains several tables, that show some university rankings. Scroll till you reach "Forbes college rankings" field. First, scrape HTML table from this field and save as forbes_ranking. Then, write a function that creates new column "Ranked on Forbes" in practice_dataset and accepts Boolean values (True or False) based on the fact whether this university in forbes_ranking or not. Final result should look as follows:

![image.png](attachment:image.png)

In [ ]:
def scrape_html(url):
    try:
        tables = pd.read_html(url)

        if len(tables) > 0:
            df = tables[0]
            return df
        else:
            print("No tables found on the page.")
            return None
    except Exception as e:
        print(f"An error occurred: {e}")
        return None

url = "https://www.upgradabroad.com/articles/forbes-unveils-americas-top-colleges-2022-list-news/"

ranking_df = scrape_html(url)

if ranking_df is not None:
    ranking_df.to_csv('forbes_ranking.csv', index=False)

In [ ]:
colleges = []
for i in ranking_df[1]:
  colleges.append(i)
colleges.remove('Colleges')
colleges[0] = 'Massachusetts Institute of Technology (MIT)'

In [ ]:
data['Ranked on Forbes'] = data['School Name'].isin(colleges)
data

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary,Ranked on Forbes
0,Massachusetts Institute of Technology (MIT),Engineering,more than national average,12600000.0,"$76,800.00","$99,200.00","$168,000.00","$220,000.00",True
1,California Institute of Technology (CIT),Engineering,more than national average,12300000.0,NaN,"$104,000.00","$161,000.00",NaN,False
2,Harvey Mudd College,Engineering,more than national average,12200000.0,NaN,"$96,000.00","$180,000.00",NaN,False
3,"Polytechnic University of New York, Brooklyn",Engineering,more than national average,11400000.0,"$66,800.00","$94,300.00","$143,000.00","$190,000.00",False
4,Cooper Union,Engineering,more than national average,11400000.0,NaN,"$80,200.00","$142,000.00",NaN,False
...,...,...,...,...,...,...,...,...,...
264,Austin Peay State University,State,less than national average,5920000.0,"$32,200.00","$40,500.00","$73,900.00","$96,200.00",False
265,Pittsburg State University,State,less than national average,5820000.0,"$25,600.00","$46,000.00","$84,600.00","$117,000.00",False
266,Southern Utah University,State,less than national average,5650000.0,"$30,700.00","$39,700.00","$78,400.00","$116,000.00",False
267,Montana State University - Billings,State,less than national average,5060000.0,"$22,600.00","$31,800.00","$78,500.00","$98,900.00",False
268,Black Hills State University,State,less than national average,4390000.0,"$27,000.00","$32,200.00","$60,900.00","$87,600.00",False

## Task 6
If time spent by website visitors on two difernet landing pages could be drawn as below, so that average time spent is the same for both. Based on the graph solely, what do you think what landing page (red or purple) performes better and why?

![image.png](attachment:image.png)

The red one, representing a normal distribution with a mean of 10 and a standard deviation of 2, suggests that the majority of visitors spend time around the mean value of 10. However, due to the wider shape of the graph (higher standard deviation), there will be some visitors who spend considerably more time and some who spend considerably less time on the landing page. This indicates that the page's performance may be more varied, with some visitors highly engaged and spending a long time, while others might leave relatively quickly.

The Purple one, representing a normal distribution with a mean of 10 and a standard deviation of 1, indicates that visitors' time spent on the landing page is more tightly clustered around the mean value of 10. The narrower shape of the hill (lower standard deviation) suggests that there is less variability in the time spent, and more visitors are spending time closer to the average value.

## Task 7
if a die is thrown 6 times, what is the probability of 3 of the numbers being even numbers?

In [ ]:
"""
To calculate the probability of rolling exactly 3 even numbers when a die
is thrown 6 times, we can use the binomial probability formula.
"""

![binom1.gif]()

In [ ]:
"""
P(X = 3) = (6C3) * (1/2)^3 * (1 - 1/2)^(6-3)


6C3 = 6! / (3! * (6-3)!) = 20


P(X = 3) = 20 * (1/2)^3 * (1/2)^3 = 20 * (1/8) = 20/8 = 2.5

Answer is 2.5%
"""